<template>
  <div @click.self="closeConrtolPanel" class="app">
    <post-form
        :showPanel="showPanel"
        @closeControlPanel="closeConrtolPanel"
        @showControlPanel="openConrtolPanel"
        @create="createPost"
    />
    <div @click.self="closeConrtolPanel" >
      <post-list
          :posts="posts"
          @remove="removePost"
      />
    </div>
  </div>
</template>


<script>
import PostForm from "@/components/PostForm";
import PostList from "@/components/PostList";

export default {
  components: {
    PostList, PostForm
  },
  data() {
    return {
      showPanel: false,
      posts: [
        {id: 1, body: "Описание поста"},
        {id: 2, body: "доставать подлинный спор подарок сердце проведение прислать смена ленинградский отвернуться расстрелять" +
              " европейский требоваться постоянный мясной вера основать ударный связывать плыть предполагаться развивать" +
              " технический признавать целевой следственный риск столик простой экономика владеть побывать общаться бормотать" +
              "гора женский ломать торговый объяснять официальный иной штука творческий западный февраль следственный общение" +
              " наружный бесконечный оружие целое федеральный сон работа министр попасться казаться торговый миг населенный " +
              "проведение программный версия окружающий покрыть поселок поселок радикальный экономический длиться компания " +
              "воздух программный сеть депутат объявить расстояние поймать противоположный смертельный магазин ценный угол " +
              "авторский посадить входить распахнуть считаться красота коридор отделение инженер саратовский вагон молодежь" +
              " поведение век задача совместный карман негативный октябрь развернуть противоречить зло кулак примитивный" +
              " решаться жуткий криминальный последовательный танец значительный зависеть отвернуться попасть ценить совет " +
              "соответствие приступить поднять коренной мгновение непрерывный ощутить отойти выразить солнце агрессивный" +
              " ученый двигатель вертикальный налить повод радостный милый распространить возможность наступить чувство"},
              {id: 3, body: "Описание поста 3"},
        {id: 4, body: "Живая шляпа — маленький веселый рассказ Николая Носова " +
              " загадочным сюжетом. Он о котенке Ваське и двух ребятах — Вове и" +
              " Вадике. Мальчики были дома, раскрашивали картинки. Васька сидел" +
              "у комода. Внезапно позади что-то упало. Дети обернулись на звук " +
              "и увидели на полу шляпу. Попробовали подойти — та сама собой стала" +
              "двигаться. Поползла, наводя на них ужас. Чтобы узнать, чем все" +
              " закончилась, читайте историю. Она научит не бояться необычного," +
              " искать всему разумное объяснение! "},
      ],
      filters: {
        reverse(posts) {
          return posts.reverse()
        }
      }
    }

  },
  methods: {
    createPost(post) {
      this.posts.push(post)
    },
    removePost(post) {
      this.posts = this.posts.filter(p => p.id !== post.id)
    },
    closeConrtolPanel(){
      this.showPanel = false
    },
    openConrtolPanel(){
      this.showPanel = true
    }
  }
}
</script>


<style>
* {
  margin: 0;
  padding: 0;
  box-sizing: border-box;
  font-family: 'Roboto', sans-serif;
  background: #F8F8F8;
}
.app {
  height: 100vh;
  padding: 60px;
}
</style>